{
  "backend/main.mo": "Main backend canister with access control, customer form submission, user profile management, and admin role operations.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Collection of short summaries describing the purpose of each frontend file in the project.",
  "frontend/DEPLOYMENT.md": "Guide for deploying the application to IC mainnet, including prerequisites and environment configuration.",
  "frontend/index.css": "Global Tailwind-based styling with theme variables for light and dark modes.",
  "frontend/index.html": "Base HTML file loading the React app with metadata, favicon, and root mounting point.",
  "frontend/src/App.tsx": "Main React app setup with routes, error boundary, analytics hook, and dashboard/admin pages.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI component displaying admin access denial with actions to log in, return home, or logout.",
  "frontend/src/components/CustomerForm.tsx": "Form component handling customer input, validation, file uploads, and submission via mutation.",
  "frontend/src/components/DashboardFilters.tsx": "Provides search and sorting controls for dashboard listings using input and select components.",
  "frontend/src/components/DashboardHeader.tsx": "Renders admin dashboard header with navigation, branding, and a user dropdown including logout.",
  "frontend/src/components/DashboardStats.tsx": "Displays total, today’s, and last 7 days submission statistics computed from customer form data.",
  "frontend/src/components/DashboardTable.tsx": "Shows a scrollable table of customer submissions with metadata and attachment view/download actions.",
  "frontend/src/components/Footer.tsx": "Footer displaying company info, contact details, and attribution with dynamic year and branding.",
  "frontend/src/components/GetFreeQuoteCtaSection.tsx": "Marketing CTA section prompting users to request a free quote and scroll to the contact form.",
  "frontend/src/components/Header.tsx": "Responsive header with logo, navigation links, mobile menu, and contact bar using BRANDING constants and router navigation.",
  "frontend/src/components/Hero.tsx": "Hero section with background image, marketing text, and a button that scrolls to the contact section.",
  "frontend/src/components/ProfileSetup.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/PublicSubmissionsDashboardSection.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/Services.tsx": "Renders a grid of insurance service cards using predefined service data and icons.",
  "frontend/src/components/SubmissionsDashboard.tsx": "Dashboard that fetches, filters, sorts, and displays form submissions with health checks, error handling, and logout support.",
  "frontend/src/components/SupportSection.tsx": "Support section showing contact options including phone, email, and office hours in card layout.",
  "frontend/src/constants/branding.ts": "Centralized branding configuration containing logo paths, company info, and contact details.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useBackendHealth.ts": "Hook that checks backend health using an anonymous actor and reports status with auto-refetching.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity login, stored identities, and related status flags.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for forms, admin status, admin creation, and admin list management using backend actor methods.",
  "frontend/src/hooks/useResetAdminCredentials.ts": "Empty placeholder file for reset-admin-credentials hook.",
  "frontend/src/hooks/useTrafficAnalytics.ts": "Stub analytics hook that logs page views to console since backend tracking is removed.",
  "frontend/src/index.css": "Tailwind CSS config with brand color variables, dark mode theme, animations, and UI utility classes.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/admin/AdminDashboardLayout.tsx": "Admin layout that verifies authentication and admin status, shows loading or access denied, and renders nested routes.",
  "frontend/src/pages/admin/AdminManagementPage.tsx": "Admin management UI for listing, adding, and removing admin principals with validation and dialogs.",
  "frontend/src/pages/admin/AnalyticsPage.tsx": "Empty analytics page placeholder.",
  "frontend/src/pages/admin/ContentPage.tsx": "Empty content management page placeholder.",
  "frontend/src/pages/admin/SettingsPage.tsx": "Empty settings page placeholder.",
  "frontend/src/pages/admin/SubmissionsPage.tsx": "Displays the submissions dashboard component.",
  "frontend/src/pages/admin/UsersPage.tsx": "Empty users page placeholder.",
  "frontend/src/pages/AdminLoginPage.tsx": "Admin login flow handling Internet Identity auth, admin verification, error states, and redirect logic.",
  "frontend/src/pages/Dashboard.tsx": "Empty dashboard page placeholder.",
  "frontend/src/pages/HomePage.tsx": "Home page composing header, hero, services, form, and footer components.",
  "frontend/src/utils/backendErrorMapping.ts": "Maps backend errors into categorized user-friendly messages with retry guidance.",
  "frontend/src/utils/logOnce.ts": "Utility to log specific errors only once, with functions to clear logged keys.",
  "frontend/src/utils/principal.ts": "Provides validation and formatting utilities for Dfinity Principals, including checks for empty, anonymous, or invalid IDs.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, storing and retrieving values from sessionStorage, and managing persisted routing parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, custom colors, animations, and enabled plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project state and requirements related to implementing admin creation and admin management features to resolve authorization issues."
}