{
  "backend/main.mo": "Motoko actor handling customer form submissions, visitor tracking, admin‑restricted queries, and blob storage with access control integration.",
  "feature_evidence.json": "Empty feature evidence report placeholder with no listed features.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend source files for reference or documentation.",
  "frontend/DEPLOYMENT.md": "Deployment guide outlining prerequisites, configuration, and steps for deploying to the Internet Computer mainnet.",
  "frontend/index.css": "Tailwind base/theme variable definitions including light and dark color schemes for global styling.",
  "frontend/index.html": "HTML entry point loading the favicon, hero image, metadata, and bootstrapping the React app.",
  "frontend/src/App.tsx": "Main React app setup with router configuration, error boundary, theme provider, and profile‑setup gating.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI screen shown when a user lacks admin access, with error display, home navigation, and logout options.",
  "frontend/src/components/CustomerForm.tsx": "Customer inquiry form with validation, insurance selection, document upload handling, and submission logic.",
  "frontend/src/components/DashboardFilters.tsx": "Provides search, filter, and sort controls for the dashboard with inputs and select menus.",
  "frontend/src/components/DashboardHeader.tsx": "Renders the admin dashboard header with branding, user profile info, and logout button.",
  "frontend/src/components/DashboardStats.tsx": "Calculates and displays submission statistics including totals, today’s count, recent activity, and popular insurance types.",
  "frontend/src/components/DashboardTable.tsx": "Displays customer submissions in a table with details, insurance interests, and document view/download actions.",
  "frontend/src/components/Footer.tsx": "Shows the site footer with branding, links, services, and contact information.",
  "frontend/src/components/Header.tsx": "Renders the main site header with branding, navigation links, and an admin login button.",
  "frontend/src/components/Hero.tsx": "Hero section with banner image, headline, and four statistic cards using icons and animations.",
  "frontend/src/components/ProfileSetup.tsx": "Dialog form for administrators to enter name and email, validate input, submit profile, and show success state.",
  "frontend/src/components/Services.tsx": "Displays a grid of insurance service cards with icons, descriptions, and feature lists.",
  "frontend/src/components/SupportSection.tsx": "Support section highlighting 24/7 assistance with cards for phone, chat, and quick response info.",
  "frontend/src/constants/branding.ts": "Centralized branding constants including logo paths, company details, and contact info.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor based on user identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, login, logout, and identity state.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for user profile retrieval and saving, admin checks, and related optimistic updates and error handling.",
  "frontend/src/index.css": "Defines Tailwind base layers and custom CSS variables for brand colors and dark mode styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/AdminLoginPage.tsx": "Implements the admin login flow using Internet Identity, handles retries, errors, and redirects based on admin status.",
  "frontend/src/pages/Dashboard.tsx": "Displays admin dashboard with form listing, filtering, sorting, and retries, and restricts access based on admin status.",
  "frontend/src/pages/HomePage.tsx": "Renders the public home page with header, hero, services, support, and customer form sections.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and clearing stored or hash-based parameters.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom colors, container settings, plugins, and brand color definitions using CSS variables.",
  "project_state.json": "Stores project metadata, feature list, and descriptions of the ICP dApp’s frontend, admin dashboard, and backend capabilities."
}