{
  "backend/main.mo": "Motoko canister implementing an insurance inquiry backend with public form submission, visitor analytics, blob document storage, and admin-only queries protected by access control.",
  "feature_evidence.json": "Machine-readable report documenting two frontend features related to adding a hero banner image asset and updating HTML preload configuration, with affected files and confidence metadata.",
  "frontend-file-summaries.txt": "Pre-generated mapping of frontend source file paths to short descriptions, covering core pages, hooks, UI components, and dashboard functionality.",
  "frontend/index.css": "Global Tailwind CSS setup defining design tokens, light/dark theme variables, and base styles for backgrounds, typography, borders, and UI consistency.",
  "frontend/index.html": "HTML entry point configuring metadata, favicon, hero image preload, SEO tags, and mounting the React application.",
  "frontend/src/App.tsx": "Root React application file configuring TanStack Router routes, global error boundary, theme provider, authentication-aware layout, and profile setup flow.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI component rendering a styled access-denied screen for non-admin users, with navigation back home and logout actions.",
  "frontend/src/components/CustomerForm.tsx": "Customer inquiry form component handling validation, insurance selection, document uploads with progress tracking, and submission to the backend.",
  "frontend/src/components/DashboardFilters.tsx": "Renders a filter card with search input, insurance type filter, and sort selector for the dashboard, emitting changes via callback props.",
  "frontend/src/components/DashboardHeader.tsx": "Sticky admin dashboard header that loads and displays the logged-in user profile, branding logo with fallback, and a logout button.",
  "frontend/src/components/DashboardStats.tsx": "Computes and displays summary statistics from customer forms, including totals, today’s submissions, last 7 days, and most popular insurance type.",
  "frontend/src/components/DashboardTable.tsx": "Displays customer submission records in a scrollable table with badges, contact info, and document view/download actions, plus an empty-state UI.",
  "frontend/src/components/Footer.tsx": "Site footer showing branding, company description, quick links, services, and contact information with logo fallback handling.",
  "frontend/src/components/Header.tsx": "Public site header with branding, navigation links, and an Admin Login button that routes to the admin login page, including logo fallback logic.",
  "frontend/src/components/Hero.tsx": "Renders the landing page hero section with a banner image, shareable preview link, headline text, and animated statistic cards using Lucide icons. Handles image load errors with local state and applies extensive Tailwind-based styling and animations.",
  "frontend/src/components/ProfileSetup.tsx": "Displays a modal dialog to collect and validate an administrator's name and email, then saves the profile via a React Query mutation. Manages form state, validation errors, loading, and a success confirmation UI.",
  "frontend/src/components/Services.tsx": "Shows a grid of insurance service offerings (life, health, vehicle, property, travel, accident) defined in a local configuration array. Each card includes an icon, description, feature list, and animated hover effects.",
  "frontend/src/components/SupportSection.tsx": "Renders a customer support section highlighting 24/7 availability, phone support, live chat, and fast response times. Uses styled cards, call-to-action buttons, and animated visual elements.",
  "frontend/src/constants/branding.ts": "Defines centralized branding constants for GB Insurance, including logo paths, company identity text, and contact details. Serves as a single source of truth for brand-related data.",
  "frontend/src/hooks/useActor.ts": "Provides a React hook that creates and caches a backend actor using React Query, supporting both anonymous and authenticated identities. Reinitializes access control with a secret token and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using Dfinity AuthClient. Manages identity persistence, login/logout flows, and detailed login status flags for use across the app.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as the caller’s user profile, admin status, and related entities, with optimistic updates, cache invalidation, and toast notifications.",
  "frontend/src/index.css": "Sets up Tailwind CSS and defines extensive CSS variables for the GB Insurance brand color system, including light and dark mode themes using OKLCH colors.",
  "frontend/src/main.tsx": "Application entry point that creates the React root and wraps the app with React Query and Internet Identity providers, while importing global styles.",
  "frontend/src/pages/AdminLoginPage.tsx": "Implements the admin login and verification flow using Internet Identity, handling authentication states, retries, error handling, and redirecting authorized admins to the dashboard.",
  "frontend/src/pages/Dashboard.tsx": "Admin-only dashboard page that fetches and displays customer forms, enforces authentication and admin access, and provides filtering, sorting, refresh, and logout functionality.",
  "frontend/src/pages/HomePage.tsx": "Public landing page that composes header, hero, services, support, customer form, and footer components into the main homepage layout.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from query strings or hash routes, persisting them in sessionStorage, and safely retrieving or clearing stored values.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode via class, scanning frontend source files, and extending the theme with centered containers, custom breakpoints, and a comprehensive OKLCH-based color system aligned to GB Insurance branding. It also integrates typography, container queries, and animation plugins.",
  "project_state.json": "Project metadata describing the GB Insurance ICP dApp, including schema/versioning and a high-level summary of the public marketing site, admin dashboard, and Motoko backend. It enumerates existing features such as lead capture forms, optional document uploads, Internet Identity authentication, access control, and admin-only functionality."
}