{
  "backend/main.mo": "Motoko backend defining types, admin authentication with password and access control, visitor stats, site content management, and storage mixins.",
  "feature_evidence.json": "Feature evidence report listing implemented frontend files, components, and requirements for public dashboard rendering and in‑page navigation.",
  "frontend-file-summaries.txt": "Collection of short summaries describing the purpose of each frontend file in the project.",
  "frontend/DEPLOYMENT.md": "Deployment guide explaining how to deploy the app to the IC mainnet with environment configuration steps.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables, light and dark mode tokens, and base styling.",
  "frontend/index.html": "HTML entry point setting metadata, favicon, preload assets, and mounting the React root.",
  "frontend/src/App.tsx": "Main React app configuring routing, error boundary, layout, admin dashboard routes, and profile setup modal.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Component showing an access denied message with optional admin initialization error and actions for logout or returning home.",
  "frontend/src/components/CustomerForm.tsx": "Customer form component handling input fields, validation, file uploads with progress, and submission via mutation.",
  "frontend/src/components/DashboardFilters.tsx": "Provides search, insurance-type filter, and sort controls for dashboard data.",
  "frontend/src/components/DashboardHeader.tsx": "Renders the admin dashboard header with branding, user profile display, and logout functionality.",
  "frontend/src/components/DashboardStats.tsx": "Calculates and displays statistics such as total submissions, today’s count, recent activity, and most popular insurance type.",
  "frontend/src/components/DashboardTable.tsx": "Displays customer submissions in a scrollable table with details, insurance badges, and document download/view actions.",
  "frontend/src/components/Footer.tsx": "Footer showing branding, contact info, office hours, and app settings-driven fields.",
  "frontend/src/components/Header.tsx": "Responsive header with branding, navigation links, maintenance alert, and mobile menu toggle.",
  "frontend/src/components/Hero.tsx": "Hero section that loads dynamic text and image, plus action buttons and stats grid.",
  "frontend/src/components/ProfileSetup.tsx": "Administrator profile setup dialog with validation, save mutation, and success state.",
  "frontend/src/components/PublicSubmissionsDashboardSection.tsx": "Wrapper section that displays the submissions dashboard with a heading.",
  "frontend/src/components/Services.tsx": "Services section rendering static or dynamic insurance services with icons and descriptions.",
  "frontend/src/components/SubmissionsDashboard.tsx": "Dashboard listing customer submissions with search, filtering, sorting, and backend health/error handling.",
  "frontend/src/components/SupportSection.tsx": "Support section showing contact options, email, phone, and office hours from app settings.",
  "frontend/src/constants/branding.ts": "Defines centralized branding info including logo paths, company details, and contact information.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to the user's identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useBackendHealth.ts": "Checks backend availability by calling a public query and exposes health status with auto‑refresh.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identities, and status management.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend queries and mutations with health-aware logic, providing admin, profile, and form operations.",
  "frontend/src/hooks/useResetAdminCredentials.ts": "Empty file with no implementation.",
  "frontend/src/index.css": "Defines Tailwind setup and brand-specific CSS variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminDashboardLayout.tsx": "Admin dashboard layout checking auth/admin status, rendering navigation tabs, and showing nested routes.",
  "frontend/src/pages/admin/ContentPage.tsx": "Admin page for editing site content with image upload, form fields, and save functionality.",
  "frontend/src/pages/admin/SettingsPage.tsx": "Admin interface to view and update global application settings such as maintenance mode and contact info.",
  "frontend/src/pages/admin/SubmissionsPage.tsx": "Renders the submissions dashboard component with a title.",
  "frontend/src/pages/admin/UsersPage.tsx": "Admin page listing user profiles and providing a dialog to edit user details.",
  "frontend/src/pages/AdminLoginPage.tsx": "Implements admin login flow using Internet Identity and password validation with health and admin checks.",
  "frontend/src/pages/Dashboard.tsx": "Empty dashboard page file.",
  "frontend/src/pages/HomePage.tsx": "Renders the public homepage with header, hero, services, submissions, form, and footer components.",
  "frontend/src/utils/backendErrorMapping.ts": "Utilities to categorize backend errors, extract trap messages, and generate user‑friendly error text.",
  "frontend/src/utils/logOnce.ts": "Utility to log specific errors only once and manage logged‑error state.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routes), persist them in sessionStorage, and clear them when needed.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom theme colors, container settings, plugins, and brand color variables.",
  "project_state.json": "Captures the project’s current state, features, and requests related to showing the admin dashboard on the public homepage."
}