{
  "kind": "build_request",
  "title": "Display the dashboard directly on the homepage (publicly visible)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Render the existing dashboard content directly on the homepage and make it visible to all users without requiring Internet Identity authentication, while keeping the existing protected /dashboard route unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "can't find the admin dashboard, place it in an obvious place",
          "1. homepage 2. visible to all users 3. dashboard",
          "2"
        ]
      },
      "acceptanceCriteria": [
        "Visiting the root route (\"/\") shows a clearly labeled section titled \"dashboard\" on the homepage.",
        "The dashboard section renders the same submissions dashboard UI currently shown under the protected dashboard area (the content from the submissions view: heading, stats, filters, and table).",
        "The dashboard section renders without triggering the admin access gate (it must not show the AccessDeniedScreen for non-admin/non-authenticated users when viewed on the homepage).",
        "The existing /dashboard route continues to require admin access as it does today (no change to AdminDashboardLayout access control)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add an in-page navigation affordance so the dashboard is easy to find from the top of the homepage (e.g., a \"dashboard\" link that scrolls to the dashboard section).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "place it in an obvious place",
          "1. homepage",
          "3. dashboard"
        ]
      },
      "acceptanceCriteria": [
        "From the top of the homepage, there is a visible navigation element labeled \"dashboard\".",
        "Activating the \"dashboard\" navigation element scrolls/jumps to the dashboard section on the homepage.",
        "User-facing text for the label is exactly \"dashboard\" (lowercase), as requested."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only).",
    "Do not edit frontend/src/hooks/useInternetIdentity.ts or frontend/src/hooks/useActor.ts (immutable paths).",
    "Backend must remain single-actor (no new backend services/canisters)."
  ],
  "nonGoals": [
    "Do not change backend schema or add new backend endpoints for this change.",
    "Do not remove or weaken admin authentication/authorization for the existing /dashboard admin area.",
    "Do not redesign unrelated homepage sections (Hero/Services/Contact/Form) beyond what is necessary to place the dashboard section."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}