{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Public homepage dashboard section with in-page navigation",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Render the submissions dashboard UI on the public homepage without triggering the admin access gate, while keeping the protected /dashboard route unchanged.",
      "acceptanceCriteria": [
        "Visiting the root route (\"/\") shows a clearly labeled section titled \"dashboard\" on the homepage.",
        "The dashboard section renders the same submissions dashboard UI currently shown under the protected dashboard area (the content from the submissions view: heading, stats, filters, and table).",
        "The dashboard section renders without triggering the admin access gate (it must not show the AccessDeniedScreen for non-admin/non-authenticated users when viewed on the homepage).",
        "The existing /dashboard route continues to require admin access as it does today (no change to AdminDashboardLayout access control)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PublicSubmissionsDashboardSection.tsx",
          "operation": "create",
          "description": "Create a homepage-embeddable dashboard section that includes a visible section title exactly \"dashboard\" and reuses the existing submissions dashboard UI (stats, filters, table) without wrapping in AdminDashboardLayout. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/SubmissionsPage.tsx",
          "operation": "modify",
          "description": "Refactor to extract the submissions dashboard UI (heading, stats, filters, table, loading/error/health states) into a reusable component consumed by both the admin SubmissionsPage and the new public homepage dashboard section, preserving existing admin behavior and visuals."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Render the new public dashboard section directly on the homepage (root route) within the existing page structure, ensuring it is publicly visible and not gated by admin/auth logic."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a top-of-homepage navigation element labeled \"dashboard\" that scrolls/jumps to the homepage dashboard section.",
      "acceptanceCriteria": [
        "From the top of the homepage, there is a visible navigation element labeled \"dashboard\".",
        "Activating the \"dashboard\" navigation element scrolls/jumps to the dashboard section on the homepage.",
        "User-facing text for the label is exactly \"dashboard\" (lowercase), as requested."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Add a visible navigation link labeled exactly \"dashboard\" (desktop and mobile) that targets the homepage dashboard section anchor and closes the mobile menu when activated, without redesigning unrelated header links. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Ensure the homepage dashboard section has a stable anchor target (e.g., an element id) that the header's \"dashboard\" link scrolls/jumps to."
        }
      ]
    }
  ]
}