{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove shareable preview image action from admin dashboard UI",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove any admin-dashboard UI control labeled “Open shareable preview image” and ensure no dashboard interaction opens the share-preview image in a new tab/window.",
      "acceptanceCriteria": [
        "When viewing the admin dashboard route, there is no button/link/menu item labeled “Open shareable preview image”.",
        "No dashboard UI interaction opens the shareable preview image in a new tab/window.",
        "The removal does not affect non-dashboard pages (e.g., the public homepage) unless the removed control was actually shared/reused by the dashboard."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DashboardHeader.tsx",
          "operation": "modify",
          "description": "Remove any dashboard header action/link/menu entry labeled “Open shareable preview image” and any associated click handler (e.g., window.open) if present or introduced via shared header variants; confirm the dashboard header renders without that control."
        },
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Audit and remove any dashboard-level UI wiring that could render or trigger “Open shareable preview image” (including any callback that opens the generated share-preview image in a new tab/window) while keeping all other dashboard functionality unchanged."
        },
        {
          "path": "frontend/src/components/DashboardTable.tsx",
          "operation": "modify",
          "description": "Ensure the dashboard table does not include any action labeled “Open shareable preview image” and does not open the share-preview image asset; keep existing document view/download behaviors intact."
        },
        {
          "path": "frontend/src/components/DashboardFilters.tsx",
          "operation": "modify",
          "description": "Verify dashboard filters do not render or reference any action labeled “Open shareable preview image”; remove any such UI element if found without impacting filtering/sorting."
        }
      ]
    }
  ]
}